
# 유저(사용자)
insert into user_tb
(user_logintype,user_status,user_identity,user_nickname, user_pw,user_name,user_zipcode,user_addr,user_addrdetail,user_addretc,user_email,user_phone) 
values
(0,1,0,'널뛰기','abcd1234','김사자','13310','경기 성남시 수정구 수정북로11번길 7-1','201호','(태평동)','abcd1234@naver.com','01098765432'),
(0,1,0,'왜뛰어','abcd1234','하남자','15870','경기 군포시 번영로 380','406동 507호','(산본동, 한라주공4단지)','abcd12345@naver.com','01075645781'),
(0,1,0,'안뛰어','abcd1234','최애리','16293','경기 안양시 만안구 경수대로 1141','205호','(안양동, 그린하이빌)','tkffuw@naver.com','01057671531');

#사업자
insert into user_tb
(user_logintype,user_status,user_identity,user_nickname, user_pw,user_name,user_zipcode,user_addr,user_addrdetail,user_addretc,user_email,user_phone, user_business_num) 
values
(0,1,1,'고라니','abcd1234','호롱이','15870','경기 군포시 번영로 380','407동 1002호','(산본동, 한라주공4단지)','abcd123456@naver.com','01012341234','15755-488793'),
(0,1,1,'코끼리','abcd1234','코끼리','15870','경기 안양시 만안구 경수대로 1141','101호','(안양동, 그린하이빌)','tkffuwnj@naver.com','01045677531','15755-487193'),
(0,1,1,'캥거루','abcd1234','캥거루','16293','경기 수원시 장안구 수일로 205','201동 202호','(조원동, 광교산임광그대가)','abc23456@nate.com','01017841234','14755-488793'),
(0,1,1,'고래','abcd1234','고래','07031','서울 동작구 관악로30길 27','302동 702호','(사당동, 관악푸르지오)','cd123456@naver.com','01056341784','25755-488773'),
(0,1,1,'에이젼트','abcd1234','에이전트','16979','경기 용인시 기흥구 갈곡로 5','102동 102호',' (구갈동)','absj@naver.com','01027344344','34555-488793'),
(0,1,1,'판다','abcd1234','판다','22021','인천 연수구 랜드마크로 113','203동 1203호',' (송도동, e편한세상 송도)','tlftn23456@naver.com','01075349134','35455-488573');

# 사업장
insert into business_tb
(business_name,business_zipcode, business_addr,business_addrdetail,business_addretc, business_phone,business_email,business_category,business_hashtag,business_main_intro,
business_workplace_detail,business_workplace_rule,business_workplace_score,USER_NUM_FK, business_pick_animal_type, business_min_charge) 
values
('버블독','10011','경기도 김포시 하성면 태산로19번길 22','버블독', '(태산로19번길 22)','01037893789','rhtod@naver.com',1,'#강아지','강아지 배운다 코딩을',
'저희 가게는 요즘 트렌드를 따라서 강아지에게도 코딩을 가르쳐드리고 있습니다','싸우지 마세요',5,2,0, 30000),
('바우밸리애견호텔','15259','경기 안산시 상록구 안산천서로 223-1','바우밸리애견호텔', ' (월피동)','01082462201','zheld@naver.com',1,'#강아지#고양이','안녕하세요',
'NullPointException','하지마세요',4,3,1, 20000),
('펫그라운드','04338','서울특별시 용산구 용산동2가 27-3','펫그라운드', '(용산동2가 27-3)','01074199990','djfuqek@google.com',1,'#고양이','고양이도 배운다 코딩을',
'저희 가게는 요즘 트렌드를 따라서 고양이에게도 코딩을 가르쳐드리고 있습니다','싸워라~ 짝!',3,4,3, 50000),
('하임동물병원','16834','경기도 용인시 수지구 포은대로 450','하임동물병원', ' (풍덕천동)','01078984300','rhtod@naver.com',2, '#고양이#강아지',
'영웅은 죽지않아요','Medic','heal',4,5,2,30000),
 ('비타민동물메디컬센터','13941','경기도 안양시 동안구 비산동 관악대로 267','비타민동물메디컬센터', '(비산동)','01042657582','help@nate.com',2,'#강아지#고양이','환자발생',
 '치료해줍니다','병원입니다',3,6, 0,50000);
 
 
#호텔 별 동물 종류 / 무게 / 가격 
#버블독
insert business_charge_tb (BUSINESS_PLACE_NUM_FK,animal_type,animal_weight,one_day_charge)
values
# 강아지
(1,1,'1 ~ 5kg',40000),(1,1,'5 ~ 10kg',80000),(1,1,'11 ~ 15kg',120000),(1,1,'15 ~ 20kg',150000),(1,1,'20kg 이상',180000), 
# 고양이       
(1,2,'1 ~ 5kg',30000),(1,2,'5 ~ 10kg',60000),(1,2,'10kg 이상',80000),          
# 새             
(1,3,'1 ~ 3kg',20000),                           
# 파충류    
(1,4,'1 ~ 5kg',20000),(1,4,'5 ~ 10kg',40000),(1,4,'10 ~ 15kg',60000),(1,4,'15kg 이상',80000),                
# 양서류
(1,5,'~1kg',10000),(1,5,'1 ~ 3kg',150000),
# 설치류    
(1,6,'~ 1kg',10000),(1,6,'1 ~ 3kg',15000),
# 족제비과  
(1,7,'1 ~ 3kg',20000),(1,7,'3 ~ 6kg',40000),
# 돼지류
(1,8,'1 ~ 5kg',30000),(1,8,'5 ~ 10kg',65000),(1,8,'10 ~ 15kg',90000),(1,8,'15kg 이상',140000),    
# 토끼류   
(1,9,'1 ~ 3kg',20000),(1,9,'3 ~ 6kg',40000),(1,9,'6 ~ 9kg',60000),(1,9,'10kg 이상',80000),                            
# etc
(1,0,'1 ~ 3kg',20000);  
 
 
#바우밸리애견호텔  
insert business_charge_tb (BUSINESS_PLACE_NUM_FK,animal_type,animal_weight,one_day_charge)
values
# 강아지
(2,1,'1 ~ 5kg',50000),(2,1,'5 ~ 10kg',80000),(2,1,'10 ~ 15kg',120000),(2,1,'15 ~ 20kg',150000),(2,1,'20kg 이상',180000),                           
# 고양이       
(2,2,'1 ~ 3kg',20000),(2,2,'3 ~ 6kg',60000),(2,2,'6kg 이상',80000),
# 새             
(2,3,'1 ~ 3kg',20000),                           
# 파충류    
(2,4,'1 ~ 5kg',20000),(2,4,'5 ~ 10kg',40000),(2,4,'10 ~ 15kg',60000),(2,4,'15kg 이상',80000),                
# 양서류
(2,5,'~1kg',10000),(2,5,'1 ~ 3kg',150000),
# 설치류    
(2,6,'~ 1kg',10000),(2,6,'1 ~ 3kg',15000),
# 족제비과  
(2,7,'1 ~ 3kg',20000),(2,7,'3 ~ 6kg',40000),
# 돼지류
(2,8,'1 ~ 5kg',30000),(2,8,'5 ~ 10kg',65000),(2,8,'10 ~ 15kg',90000),(2,8,'15kg 이상',140000),    
# 토끼류   
(2,9,'1 ~ 3kg',20000),(2,9,'3 ~ 6kg',40000),(2,9,'6 ~ 9kg',60000),(2,9,'10kg 이상',80000),                            
# etc
(2,0,'1 ~ 3kg',20000); 
                           
#펫그라운드 
insert business_charge_tb (BUSINESS_PLACE_NUM_FK,animal_type,animal_weight,one_day_charge)
values
# 강아지
(3,1,'1 ~ 5kg',50000),(3,1,'5 ~ 10kg',80000),(3,1,'11 ~ 15kg',120000),(3,1,'15 ~ 20kg',150000),(3,1,'20kg 이상',180000),                           
# 고양이       
(3,2,'1 ~ 3kg',26000),(3,2,'3 ~ 6kg',66000),(3,2,'6kg 이상',90000),
# 설치류    
(3,6,'~ 1kg',10000),(3,6,'1 ~ 3kg',15000),
# 돼지류
(3,8,'1 ~ 5kg',50000),(3,8,'5 ~ 10kg',80000),(3,8,'10 ~ 15kg',140000),(3,8,'15kg 이상',200000), 
# 토끼류   
(3,9,'1 ~ 3kg',19000),(3,9,'3 ~ 6kg',40000),(3,9,'6 ~ 9kg',60000),(3,9,'10kg 이상',80000);
 
 
#하임동물병원
insert business_charge_tb (BUSINESS_PLACE_NUM_FK,animal_type,animal_weight,one_day_charge)
values
# 강아지       
(4,1,'1 ~ 5kg',60000),(4,1,'5 ~ 10kg',80000),(4,1,'11 ~ 15kg',120000),(4,1,'15 ~ 20kg',150000),(4,1,'20kg 이상',210000),
# 고양이       
(4,2,'1 ~ 3kg',50000),(4,2,'3 ~ 6kg',70000),(4,2,'6kg 이상',80000);

#비타민동물메디컬센터
insert business_charge_tb (BUSINESS_PLACE_NUM_FK,animal_type,animal_weight,one_day_charge)
values
# 강아지       
(5,1,'1 ~ 5kg',40000),(5,1,'5 ~ 10kg',60000),(5,1,'11 ~ 15kg',90000),(5,1,'15 ~ 20kg',130000),(5,1,'20kg 이상',170000),
# 고양이       
(5,2,'1 ~ 3kg',30000),(5,2,'3 ~ 6kg',70000),(5,2,'6kg 이상',80000),
# 새             
(5,3,'1 ~ 3kg',20000),                           
# 파충류    
(5,4,'1 ~ 5kg',20000),(5,4,'5 ~ 10kg',40000),(5,4,'10 ~ 15kg',60000),(5,4,'15kg 이상',80000),                
# 양서류
(5,5,'~1kg',10000),(5,5,'1 ~ 3kg',150000),
# 설치류    
(5,6,'~ 1kg',10000),(5,6,'1 ~ 3kg',15000),
# 족제비과  
(5,7,'1 ~ 3kg',20000),(5,7,'3 ~ 6kg',40000);


#예약
														#1= 예약중 / 2= 취소 / 3= 사용완료
insert book_tb (BUSINESS_PLACE_NUM_FK, USER_NUM_FK, book_status , book_regdate ,book_checkin_date, book_checkout_date, book_charge, book_request)
            values(1,1,3,'2022-08-03 10:08:56','2022-08-10 17:21:57','2022-08-16 15:00:13','240000','잘 좀 돌봐주세요~~~'),
                  (2,1,3,'2022-08-10 17:28:22','2022-08-12 09:03:45','2022-08-18 10:31:25','120000','엄청 활발하고 사람을 좋아해요.'),
                  (3,1,3,'2022-08-15 11:48:08','2022-08-20 20:13:25','2022-08-22 12:55:25','120000','공 가지고 노는걸 좋아해요.');                                                        
insert book_tb (BUSINESS_PLACE_NUM_FK, USER_NUM_FK, book_status , book_regdate ,book_checkin_date, book_checkout_date, book_charge, book_request)
			values(1,2,3,'2022-08-01 15:45:27','2022-08-02 12:30:01','2022-08-06 13:30:00','240000','밥 많이 주지마세요'), #강아지 5~10kg 4박 5일
                  (1,2,3,'2022-08-13 19:57:31','2022-08-14 11:00:57','2022-08-20 17:12:00','120000','캔 좀 따주세요'),    #고양이 1~3kg 6박 7일
				  (2,2,3,'2022-08-21 21:12:21','2022-08-22 13:40:37','2022-08-24 14:25:17','40000','많이 놀아주세요');    #토끼 1~3kg 2박 3일
                  
insert book_tb (BUSINESS_PLACE_NUM_FK, USER_NUM_FK, book_status , book_regdate , book_checkin_date, book_checkout_date, book_charge, book_request)
			values(1,3,3,'2022-08-07 14:25:24','2022-08-09 10:23:15','2022-08-10 13:30:00','180000','안물었는데요 물었습니다'), #강아지 20kg이상 1박 2일
				  (3,3,3,'2022-08-09 10:14:48','2022-08-14 09:48:57','2022-08-16 12:13:00','160000','다이어트 시켜주세요'),  # 돼지 5~10kg 2박 3일
                  (5,3,3,'2022-08-15 08:10:41','2022-08-17 11:40:57','2022-08-25 17:12:00','240000','집사야');     #고양이 1~3kg 8박 9일
                  

#리뷰
insert review_tb (BUSINESS_PLACE_NUM_FK, review_contents, review_nickname, review_regdate)
		   values(1,'다시 또 올게요','널뛰기','2022-08-17 16:47:41'),
				 (2,'사장님이 좋아요','널뛰기','2022-08-19 16:35:21'),
				 (3,'휴가끝이다...','널뛰기','2022-08-23 17:46:31'),
				 (1,'정말 봐주시기만 했어요!','왜뛰어','2022-08-07 13:25:01'),
				 (1,'오프너가 따로 없으세요','왜뛰어','2022-08-20 20:30:57'),
			     (2,'저보다 저 친해진것같아요','왜뛰어','2022-08-25 10:46:34'),
			     (1,'죄송합니다..','안뛰어','2022-08-11 11:05:25'),
				 (3,'정말 좋아요!','안뛰어','2022-08-17 09:46:01'),
				 (5,'5점 드립니다','안뛰어','2022-08-27 13:42:31');
                 
#리플
insert reply_tb(REVIEW_NUM_FK,reply_contents,BUSINESS_PLACE_NUM_FK)  
values(1,'다시 또 오세요~!!',1);
           
           

                  
                  
				  
                  
	
 